[
  {
    "title": "These Are The Five Best Stocks To Buy And Watch Now",
    "url": "https://www.investors.com/research/best-stocks-to-buy-now/?src=A00220&yptr=yahoo",
    "source": "Yahoo Finance",
    "timestamp": "2025-03-24T14:27:04Z",
    "content": "Research These Are The Five Best Stocks To Buy And Watch Now Licensing MICHAEL LARKIN 10:27 AM ET 03/24/2025 Buying a stock is easy, but buying the right stock without a time-tested strategy is incredibly hard. So what are the best stocks to buy now or put on a watchlist? Heico ( HEI ), Intercontinental Exchange ( ICE ), Tradeweb Markets ( TW ), GE Aerospace ( GE ) and Brown & Brown ( BRO ) are prime candidates. The market confounded expectations for difficulties and turned in an outstanding performance in 2023 and 2024 . Donald Trump's election victory initially boosted stocks, but gains have faded as traders weigh the pros and cons of his plans, such as levying tariffs, as we move deeper into 2025. The Federal Reserve is also seeing fewer interest rate cuts ahead amid ongoing labor market strength and stubbornly high inflation. ↑ X Market Still Vulnerable As Rally Attempt Continues; Take-Two, Life Time, Okta In Focus See All Videos NOW PLAYING Market Still Vulnerable As Rally Attempt Continues; Take-Two, Life Time, Okta In Focus Best Stocks To Buy: The Crucial Ingredients Remember, there are thousands of stocks trading on the NYSE and Nasdaq. But you want to find the very best stocks right now to generate massive gains. The IBD Methodology offers clear guidelines on what you should be looking for. Invest in stocks with recent quarterly and annual earnings growth of at least 25%. Look for companies that have new, game-changing products and services. Also consider not-yet-profitable companies, often recent IPOs, that are generating tremendous revenue growth. Using such an approach can help give you an edge over the benchmark S&P 500. Outdoing this industry benchmark is key to generating exceptional returns over the long term. In addition, keep an eye on supply and demand for the stock itself, focus on leading stocks in top industry groups, and aim for stocks with strong institutional support. Once you have found a stock that fits the criteria, it is then time to turn to stock charts to plot a good entry point . You should wait for a stock to form a base and then buy it once it reaches a buy point , ideally in heavy volume. In many cases, a stock reaches a proper buy point when it breaks above the original high on the left side of the base. More information on what a base is, and how charts can be used to win big on the stock market, can be found here . IBD Newsletters Get exclusive IBD analysis and actionable news daily. IBD Newsletters Get exclusive IBD analysis and actionable news daily. How To Invest Market Prep Tech Report Please enter a valid email address Please select a newsletter Get these newsletters delivered to your inbox & more info about our products & services. Privacy Policy & Terms of Use Thank You! You will now receive IBD Newsletters Something Went Wrong! Please contact customer service Don't Forget The Stock Market Direction When Buying Stocks A key part of investing is to keep track of the market . Most stocks, even the very best, follow the market direction. Invest when the stock market is in a confirmed uptrend and move to cash when the stock market goes into a correction. The stock market turned in stunning gains in 2023 and 2024. The major indexes surged to record highs in the wake of Donald Trump's presidential victory, but tariff worries and a more cautious outlook from the Fed on interest rates are now weighing on stocks. The stock market is well off recent highs and remains under considerable pressure. The S&P 500 has fallen below its 50-day moving average and 200-day line while the Nasdaq composite has undercut its 200-day moving average, a bearish look indeed. Recent negative action means investors should be on their guard. Buying even high-quality issues with good growth prospects is risky. Taking smaller pilot positions is an option, though building a robust watchlist may be the wisest approach for now. The selections below are among the best stocks to buy or watch now. The IBD 50 is also a rich hunting ground. In addition, it is now especially crucial to stay on top of sell signals . Any stock that falls 7% or 8% from your purchase price should be jettisoned. Also beware of sharp breaks below the 50-day or 10-week moving average . Things can change quickly when it comes to the stock market. Make sure to keep a close eye on the market trend page here . Best Stocks To Buy Or Watch Heico Intercontinental Exchange Tradeweb Markets GE Aerospace Brown & Brown Now let's look at these five stocks to buy. An important consideration is that these best stocks to buy and watch all boast impressive relative strength. Heico Stock The aerospace stock has formed a cup-with-handle base, according to MarketSurge analysis . The buy point here sits at 270.37, with an early entry at 266.03 The stock sits clear of its 50-day line and recently found support at its 21-day exponential moving average . Meanwhile, the relative strength line is near recent highs, an encouraging sign. Overall performance is excellent, which is reflected in HEI's perfect IBD Composite Rating of 99 . The stock is currently displaying leadership, as it sits near the summit of IBD's Aerospace/Defense industry group . Earnings performance is a key strength for the stock, with its EPS Rating sitting at 95 out of 99 . Recent growth has been very strong, with earnings rising by an average 35% over the past three quarters. EPS has accelerated for the past five quarters. Earnings growth is expected to hold firm in the year ahead. Analysts seeing EPS rising 23% in 2025, which is just shy of the 25% growth sought by those following IBD investing principles. Earnings growth is then expected to slow to 12% next year. Institutions have added to their holdings of the stock lately, which is reflected in an Accumulation/Distribution Rating of B. In total, 62% of Heico stock is held by funds, according to MarketSurge data . This is stout backing. Heico's flight support group designs, manufactures and repairs aircraft and engine replacement parts. Its products are used in commercial and military aircraft, turbines and missiles. Additionally, its electronic technologies group makes power converters and accessories, microwave switches and lasers used in the aviation, electronics, medical and telecommunications industries. Heico is a member of the high-flying IBD 50 list of leading growth stocks Intercontinental Exchange Stock The financial services stock is in a buy zone above a cup-base entry of 167.99, MarketSurge analysis shows . The buy zone here runs as high as 5% above this level. Shares sit clear of the 50-day moving average . Intercontinental Exchange stock is also finding support at the 21-day line. These are encouragingly bullish signs. The relative strength line is spiking again following a dip during its consolidation phase. This line reflects a stock's gains vs. the benchmark S&P 500. Intercontinental Exchange is drastically outpacing the benchmark S&P 500 so far this year. It's already up around 17% in 2025. The stock is an excellent all-around performer, with its IBD Composite Rating coming in at a muscular 96 out of 99. Intercontinental Exchange is a global financial exchanges company. Its operations include the New York Stock Exchange. Earnings performance is solid, with its EPS Rating coming in at 82 out of 99 . Earnings have grown by an average 9% over the past three quarters. While solid, it is far short of the 25% growth levels sought by investors following The IBD Methodology . However, in the most recent quarter EPS accelerated to 14% growth. CEO Jeffrey Sprecher said this was a testament to the company's \"all-weather\" business model. Wall Street expects earnings performance to improve, with full-year EPS seen rising 11% in fiscal 2025 before accelerating to 12% growth in 2026. Big money has been loading up on Intercontinental Exchange stock of late. The stock's Accumulation/Distribution Rating coming in at A- reflects far heavier buying than selling. In total, 51% of ICE stock is currently held by funds, according to MarketSurge data . A number of highly rated funds hold shares in the company. These include the Franklin Growth Fund (FKGRX) and the Janus Henderson Forty Fund (JARTX). Looking For The Next Big Stock Market Winners? Start With These 3 Steps Tradeweb Markets Stock The financial services play is another of the best stocks to buy now or watch as it trades in the actionable zone above a cup-with-handle base buy point of 140.48. The relative strength line is spiking, and has hit 12-month highs on a weekly chart. The stock has burst above its 50-day line, a positive, and also sits clear of its short-term moving averages. TW stock has a terrific IBD Composite Rating of 98 . This is a reflection of excellent all-around performance. Earnings performance is a key strength, with the stock holding a mighty EPS Rating of 97 out of 99. Earnings have grown by an average 30% over the past three quarters, stout gains indeed. Wall Street see further progress ahead, with EPS expected to rise 17% this year and a further 13% in 2026. Price performance has also been solid, with TW ranking among the top 14% of issues in terms of price performance over the past 12 months. The stock is up nearly 9% so far this year . Institutions have been net buyers of Tradeweb stock of late, with its Accumulation/Distribution Rating coming in at B- . The number of firms holding TW shares at the moment is very strong, according to MarketSurge data . The Allspring Growth Fund (SGRAX) and the Franklin Growth Fund (FKGRX) are among the noteworthy holders. Tradeweb benefits from long-term tailwinds as it gains market share in increasingly electronic bond markets, according to Morningstar analyst Michael Miller. Tradeweb's interest-rate and credit segments are \"the heart of the company,\" making up 79% of its revenue in 2024, he said. With most fixed-income trading still primarily voice based, \"Tradeweb has a long runway of growth ahead of it,\" he wrote in a Feb. 6 note. There is a consensus buy rating on Tradeweb stock, according to TipRanks . The average price target comes in at 143.40. GE Aerospace Stock GE stock has formed a flat base with an ideal entry point of 212.19, according to MarketSurge analysis . It is buyable as much as 5% above this level. It is also offering an early entry of 206.82. Early entries are riskier than usual at the moment due to market conditions. Shares have rebounded well after getting support at the 10-week line moving average, which is encouraging. In addition, the relative strength line sits near 12-month highs and has been making good progress since early December. This is a bullish indicator. GE stock currently holds an IBD Composite Rating 97 out of 99 . This means its overall performance is very strong indeed. Earnings performance is a key strength for the stock. It has an EPS Rating of 95 out of 99 . In the most recent quarter EPS spiked by a remarkable 103%. Earnings have risen by an average 62% over the past three quarters. This is stout growth indeed. Wall Street expects further improvement ahead. EPS is projected to rise 18% in 2025 before accelerating to 19% growth next year. The stock has been making substantial price progress in 2025, rising by more than 22% so far this year . GE Aerospace has risen from the ashes of General Electric's big breakup. The industrial conglomerate spun out its energy and health care businesses as GE Vernova ( GEV ) and GE HealthCare ( GEHC ). GE Aerospace got a prize with a rich history — the GE ticker itself. The conglomerate announced the split in 2021. GE HealthCare began trading as an independent company in January 2023. GE Vernova launched on April 2 last year. Before the spinouts, General Electric shed a number of assets and operations, from lighting to locomotives. In November 2017, GE began signaling its eventual breakup amid financial troubles. Look For This Signal As Futures Jump On Trump Tariff 'Flexibility' Brown & Brown Stock The insurance play is near the top of a buy zone above a cup-base entry of 114.15. This comes after shares cleared an early buy point of 109.06. This is a second-stage pattern, according to MarketSurge analysis , which counts as early. This is a positive. Brown & Brown now has a four-weeks-tight pattern forged at the top of the cup-base buy zone. The buy point is 121.25. BRO has a near-perfect IBD Composite Rating of 98 due to the stock's excellent all-around performance. Earnings performance is robust, with Brown & Brown holding an EPS Rating of 95 out of 99. Additionally, earnings have grown by an average 18% over the past three quarters. The firm recently reported a 25% year-over-year EPS increase to 86 cents, comfortably beating expectations for 77 cents. Revenue jumped 15% to $1.18 billion. Analysts see EPS growth of 9% both this year and in 2026, reflecting the firm's consistent performance. It is also solid on the technical front as well, as it sits in the top 15% of issues in terms of price performance over the past 12 months. Additionally, it is now up around 16% so far this year . This is much better than the benchmark S&P 500's performance. Institutions have added to their holding of the stock lately, with its Accumulation/Distribution Rating coming in at B . BRO boasts an impressive level of institutional backing. Funds currently hold 52% of shares, MarketSurge data shows . The stock is also showing leadership as it sits near the summit of the competitive Insurance-Brokers industry group. At the end of January, RBC Capital analyst Scott Heleniak raised the firm's price target on Brown & Brown to 120 from 118. Heleniak noted that the company's organic growth trends remain strong and that overall new business trends remain healthy. Bank of America also raised its price target on Brown & Brown to 117 from 116, maintaining a neutral rating on the S&P 500 stock. BofA analysts wrote that the price target is \"rising modestly in line with higher forecasts.\" Please follow Michael Larkin on X at @IBD_MLarkin for more analysis of growth stocks. YOU MIGHT ALSO LIKE: Is Trump Media A Buy After He Takes Office? Seven Best Stocks For Magnificent Earnings Growth Join IBD Live Each Morning For Stock Tips Before The Open MarketSurge: Research, Charts, Data And Coaching All In One Place This Is The Ultimate Warren Buffett Stock, But Should You Buy It?",
    "summary": "Research These Are The Five Best Stocks To Buy And Watch Now Licensing MICHAEL LARKIN 10:27 AM ET 03/24/2025 Buying a stock is easy, but buying the right stock without a time-tested strategy is incredibly hard. So what are the best stocks to buy now or put on a watchlist? Heico ( HEI ), Intercontinental Exchange ( ICE ), Tradeweb Markets ( TW ), GE Aerospace ( GE ) and Brown & Brown ( BRO ) are prime candidates. The market confounded expectations for difficulties and turned in an outstanding performance in 2023 and 2024.",
    "sentiment": 0.8762886597938144
  },
  {
    "title": "Retirement expert explains how to avoid common planning mistakes",
    "url": "https://finance.yahoo.com/news/retirement-expert-explains-how-to-avoid-common-planning-mistakes-163432688.html",
    "source": "Yahoo Finance",
    "timestamp": "2025-03-23T16:34:32Z",
    "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Retirement expert explains how to avoid common planning mistakes Robert Powell Updated Sun, Mar 23, 2025, 6:34 PM 7 min read Listen and subscribe to Decoding Retirement on Apple Podcasts , Spotify , or wherever you find your favorite podcasts. When planning for the future, people often get caught up in short-term news rather than focusing on the long-term strategy, even though retirement planning can stretch across decades. And that’s just one of several mistakes those saving for or living in retirement are making, according to Nick Nefouse, global head of retirement solutions and head of LifePath at BlackRock. “If I think about retirement planning, it is almost always a long horizon,” Nefouse said in a recent episode of Decoding Retirement (see video above or listen below). “And what we do is we get inundated with short-term news. And if you think about short-term news versus planning for retirement, they're two very different things.” Consider that a person in their 20s will spend about 45 years saving for retirement. Then, upon reaching 65, they can expect to live another 20 to 30 years on average. Combined, this represents a significant time frame for financial planning. Even someone who is 55 still has about a decade before retiring. “The reason why time horizon is so important is the longer that you're in the markets, the better the probability you're going to be successful,” he said. “But if we have this short horizon view of what's going to happen next year or next quarter, it tends not to bode very well for long-term investing.” Nefouse also suggested that individuals often make mistakes regarding risk. “We tend to think of risk myopically just as market risk,” he said. Instead, risk should be viewed as a lifecycle concept, encompassing market risk, inflation risk, longevity risk, human capital risk (job loss), and sequencing risk (bad market returns). What’s more, individuals need to consider that risk evolves over one’s lifetime. At BlackRock, a model they espouse is something called GPS — grow, protect, spend. “When you're young, it's just about maximizing growth,” he said. “And this is where you want to have the highest equity waiting in your portfolios. Really lean into growth equities. This is in your 20s, 30s, even into your 40s. From about mid-40s up until you're in retirement we really want to start adding in more protection. This is when you want to start thinking about diversifying a portfolio into things like inflation protection or into fixed income.” Read more: Retirement planning: A step-by-step guide Debunking the principal myth When you retire with a lump sum at 62, 65, or 67, there’s little guidance on how to systematically draw down assets, and many avoid even thinking about \"decumulation,\" Nefouse said. As a result, retirees tend to fixate on their account balance, reluctant to spend it. They'll use capital gains and income but resist dipping into the principal itself. “This is another big misconception,” Nefouse said. “A lot of people don't want to spend down principal in retirement.” To be fair, the fear of spending down principal is partly due to uncertainty about longevity. “When you look at the behavioral research, it's not illogical that people don't want to spend their principal,” Nefouse said. However, the point of saving is to spend the money in retirement so you can live like you spent during your working years. “You need to spend your principal,” he said. (Jeff Chevrier/Icon Sportswire via Getty Images) · Icon Sportswire via Getty Images To help individuals estimate how much they can spend in retirement, BlackRock offers a publicly available LifePath spending tool on its website, which calculates one's spending potential based on their age and savings. One way to address the principal misconception and others is to consider small decisions with major impact. Using auto-enrollment, qualified defaults (like target-date funds), and auto-escalation features in 401(k) plans can significantly improve retirement savings, Nefouse said. Qualified default investments, like target date funds, provide a structured approach to investing. These funds are designed to be more growth-oriented when an investor is younger and gradually becomes more conservative as retirement nears. “Importantly though, it’s not sitting in cash,” Nefouse said. “You’re actually in a growth asset for a much longer period of time.” This, he said, helps maximize long-term returns while managing risk appropriately over time. Don't overlook the triple tax advantage of an HSA Many workers face a dizzying array of retirement savings options, from health savings accounts (HSAs) to traditional and Roth 401(k) plans. With so many choices, how do you decide where to contribute — and how much? “This gets tricky,” Nefouse said, noting that the decision depends on personal preferences, income level, and tax considerations. But the most important step? “Just start saving somewhere.” When choosing between a Roth 401(k) and a traditional 401(k), it comes down to taxes. “We can debate [over] the Roth, which ... grows tax-free and comes out tax-free, versus the traditional, which comes out of your earnings pre-tax, then grows tax-free, and then you’re taxed,” he said. But the right choice depends on factors like “current income and expected future tax rates.” One option to consider is an HSA. “I would tell people not to overlook the HSAs,” Nefouse said. Read more: 4 ways to save on taxes in retirement What makes HSAs so powerful is their triple tax advantage: contributions are pre-tax, the money grows tax-free, and provided it’s used for qualified medical expenses, it can be withdrawn tax-free — even in retirement. “If you can stand to not spend from your HSA, this is triple tax-free,” he said. A particularly smart strategy is to “prioritize accounts that offer employer matches,” Nefouse added. “What I tell people to do is hit the 401(k), the traditional 401(k), because that tends to be where the match comes in.” The same goes for HSAs if an employer contributes. “If your company is going to give you money for being involved in those, go into those.” Then, once those bases are covered, where to save next becomes a “higher-class problem,” he said, meaning a good problem to have as you build wealth. Navigating the retirement window Nefouse also discussed how the traditional idea of retirement as a single moment — one day you’re working, the next day you’re not — is changing. Many people are opting for “partial retirements” or “encore careers” rather than stopping work entirely. They might reduce their hours, shift into a different role, or even explore a new industry altogether. “We refer to this phase as the retirement window,” Nefouse said. Unlike airline pilots, who typically retire on their 65th birthday, most Americans don’t follow a strict retirement date. Instead, between the ages of 55 and 70, they gradually transition out of full-time work, he said. While many people say they want to work longer, the reality is different, and many people don't work past age 65. Health issues — whether their own or a spouse’s — can force an earlier exit. Job loss in the late 50s or early 60s is another risk, as “it's very hard to get reemployed at the same rates,” Nefouse said. So what’s the actionable advice? “Start planning early,” Nefouse said. That means building multiple sources of income, understanding Social Security, and considering retirement income guarantees. Social Security plays a crucial role in this transition. “The longer you defer, the more money the Social Security Department is going to give you,” he said. While benefits start at 62, waiting until 70 results in significantly larger payments. “Think about it as a sliding scale — you get the least amount of money from the government at 62, and the most at 70,” Nefouse said. Each Tuesday, retirement expert and financial educator Robert Powell gives you the tools to plan for your future on Decoding Retirement . You can find more episodes on our video hub or watch on your preferred streaming service . Terms and Privacy Policy Privacy Dashboard More Info Recommended Stories",
    "summary": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Retirement expert explains how to avoid common planning mistakes Robert Powell Updated Sun, Mar 23, 2025, 6:34 PM 7 min read Listen and subscribe to Decoding Retirement on Apple Podcasts , Spotify , or wherever you find your favorite podcasts. When planning for the future, people often get caught up in short-term news rather than focusing on the long-term strategy, even though retirement planning can stretch across decades.",
    "sentiment": -0.2857142857142857
  },
  {
    "title": "Ocado waters down ethnic minority targets as bosses go cold on DEI",
    "url": "https://finance.yahoo.com/news/ocado-waters-down-ethnic-minority-133845306.html",
    "source": "Yahoo Finance",
    "timestamp": "2025-03-23T13:38:45Z",
    "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Ocado waters down ethnic minority targets as bosses go cold on DEI Hannah Boland Sun, Mar 23, 2025, 5:38 PM 3 min read In This Article: OCDDY -1.62% Ocado has been increasing its workforce in the US after securing a deal with supermarket Kroger Ocado has watered down targets to get more ethnic minority people into senior roles amid a wider rollback of diversity initiatives within corporate Britain . The London-listed technology company, which jointly owns online grocer Ocado Retail with M&S, said its goal of having 10pc of senior management roles made up of people from ethnic minorities had been pushed back to 2030 from its previous target of 2027. It comes as a growing wave of companies rein in so-called diversity, equity and inclusion (DEI) policies following a crackdown by Donald Trump in the US . The US president has banned DEI programmes at federal agencies and ended government contracts with “woke companies” that continue to adopt these policies. Ocado has been increasing its workforce in the US after securing a deal with the supermarket Kroger to supply it with the technology which powers its robotic delivery warehouses. Ocado insisted it remained committed to DEI and said the target had been delayed because its “strong rate of retention among senior managers” meant it was unlikely to hit the 10pc goal before then. At the end of its latest financial year, the level stood at 5.6pc of senior management, up from 4.5pc the prior year. A spokesman said: “It does not reflect any change in our commitment to diversity, equity and inclusion (DEI), and we are making good progress across our other goals in these areas which extend across the business and our pipeline of talent. “We strongly believe that diversity is a key driver of innovation and these targets are important for us to maintain our position as one of the UK’s most innovative technology businesses.” Last week, the US Equal Employment Opportunity Commission warned employers that their DEI policies may be illegal. Trump’s executive order on DEI has prompted a flurry of companies to ditch or scale back their diversity programmes, including Meta, Amazon and Walmart. Some British firms have started to follow suit on watering down diversity plans including GSK and BT, which have pulled DEI measures from executive bonuses. Sensodyne-maker Haleon last week said it would axe diversity targets from its executive bonus scheme, with its chief executive and chief financial officer no longer required to hit gender representation targets to maximise their pay. Last week, Tim Martin, the boss of JD Wetherspoon, said diversity schemes have become “politicised and weaponised” and called for common sense on the topic. The changes at Ocado follow concerns over years of losses at the technology company. In February, Ocado revealed it racked up a pre-tax loss of £375m for its latest financial year, compared to a £393.6m loss a year earlier. The company said it would make further job cuts as part of a drive to reduce costs and make the business profitable. Ocado said the number of redundancies would be “significantly” less than the 1,000 job cuts it made last year. Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more. Terms and Privacy Policy Privacy Dashboard More Info Recommended Stories",
    "summary": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Ocado waters down ethnic minority targets as bosses go cold on DEI Hannah Boland Sun, Mar 23, 2025, 5:38 PM 3 min read In This Article: OCDDY -1. 62% Ocado has been increasing its workforce in the US after securing a deal with supermarket Kroger Ocado has watered down targets to get more ethnic minority people into senior roles amid a wider rollback of diversity initiatives within corporate Britain.",
    "sentiment": 0.17647058823529413
  },
  {
    "title": "Barry Ritholtz explains how not to make stupid investing mistakes",
    "url": "https://finance.yahoo.com/news/barry-ritholtz-explains-how-not-to-make-stupid-investing-mistakes-143030439.html",
    "source": "Yahoo Finance",
    "timestamp": "2025-03-23T14:30:30Z",
    "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Barry Ritholtz explains how not to make stupid investing mistakes The longtime adviser has written a playbook for keeping your strategy simple and not getting in the way of compounding. Kerry Hannon · Senior Columnist Sun, Mar 23, 2025, 6:30 PM 7 min read Barry Ritholtz, co-founder and chief investment officer of Ritholtz Wealth Management and a longtime adviser, digs into the things that have made him “less stupid” in his latest book. \"How Not to Invest: The Ideas, Numbers, and Behaviors That Destroy Wealth — and How to Avoid Them\" isn’t a navel-gazing reveal of his savvy investing philosophy, but rather a playbook on the theme that steering clear of errors is much more important than scoring wins. I asked Barry to share the mistakes that trip most of us up and what we can do about it. Below are excerpts of our conversation, edited for length and clarity. Kerry Hannon: Why are most of us better off sticking to a simple investing strategy? Barry Ritholtz: Historically, simple beats complex. If you're going to make something more complicated, there has to be an absolutely compelling reason. The more complicated things are, there are more things to break. Think about how much money has been attracted to Vanguard and Blackstone's core indexing because it's simple and it works. What are some of the pitfalls of building long-term wealth? The biggest single pitfall is our tendency to interfere with the markets’ compounding. When I ask people, what is a thousand dollars invested a century ago worth today? They say, oh, a million dollars, $2 million. When you tell them it's $32 million, their heads explode. It's shocking to people. But that's the power of compounding. Please try not to get in the way of your own money compounding. It's the single best thing you can do. barry What are other common mistakes investors make? The more active you are, the more transactions you engage in, and the worse you tend to do because you're just creating more opportunities to be wrong. And we believe a lot of nonsense. Some of it is just myths that get repeated from generation to generation or ping around trading desks. I always laugh whenever I flip on TV and the market is down 2% and someone says, markets hate uncertainty. Do they really? Because there's got to be a buyer and a seller. That means that there's a disagreement as to the value of that asset. We are wildly overconfident in our abilities to do things that the professionals can't do. You know, no one would say to themselves, yeah, I could play Michael Jordan one-on-one in basketball. Nobody thinks that way. But when you step into the marketplace, you imagine that you're going to beat the house, that you're going to beat Michael Jordan. But trust me, you’re not. Something like half of all the trades are done by institutions — highly qualified, deeply motivated with the latest, greatest, fastest tools. To imagine that you're going to step in and beat them on their home fields is just another mistake. It’s also a mistake to not be selective when you dip into the fire hose of media that comes out about investing. You have to be a little discerning and discriminating. Curate viciously. You have to create your own team of people who you either watch or listen to or read. I don't mean you literally have to hire them, but hey, these are the people who have a defendable process. They've lived through a few cycles. They have a good track record. And it's not just dumb luck. On my all-star team are Morgan Housel , Jason Zweig , and Sam Ro . They have just consistently added value and been more right than wrong. They don't run around with their hair on fire when we’re in the midst of a huge volatility spike. Read more: How to start investing: A 6-step guide Sign up for the Mind Your Money weekly newsletter By subscribing, you are agreeing to Yahoo's Terms and Privacy Policy What are some questions we can ask to avoid a lot of investment mistakes? Always ask yourself, what are the risks of this trade? Is this tailored to me, or is this for a general audience? What's this going to cost — not just the outright costs, but fees, taxes, and, of course, lost opportunities. And who is giving me this advice? What's their track record and do they have a conflict of interest? Do they have a fiduciary interest to zealously represent you and to perform their duties with diligence? They can't guarantee you what the market or the economy's going to do in the future, but can they say to you, this is a reasonable portfolio that is defendable and rational and increases the odds that you'll have a successful outcome down the road? You quote John Bogle, founder of Vanguard, as saying, “just buy the haystack.” In other words, stick with index funds. Why is that still a great philosophy? In any given year, a majority of active fund managers underperform their benchmark , say, the S&P 500. Go 10 years and you’re in the single digits of managers who earn their keep and outperform the benchmark. Take it to 20 years, and it's virtually nobody. You end up with a handful of outlier names and they become household names because they're unicorns — Warren Buffett, Peter Lynch , Bill Miller. With the indexes, you get diversification especially if you invest in a bunch of different indexes. You are guaranteed to find the Nvidias, the Apples, the Amazons, whatever are the biggest winners. And you get them in increasing stakes as they do better and better. \"Please try not to get in the way of your own money compounding. It's the single best thing you can do,\" Barry Ritholtz, longtime investor and author (pictured), says. (Photo courtesy of Barry Ritholtz) You say this is the golden age for investors. What do you mean by that? You can move money around effortlessly. You can trade for free. You can buy anything. Back in the old days, if you wanted to own international stocks, it was expensive. To say nothing of the power of walking around with this stuff in your phone, it's really amazing. Software and technology give investors tools that are just so simple and so inexpensive and so effective. That's why I call this the golden age of investing. We can do things people dreamed about 25 years ago. Everybody gets second-by-second, tick-by-tick updates. You want to see how you're doing today, this week, month, year to date, the past 12 months — it's all right there. It's instantaneous. But please don't look at your portfolio tick by tick. It'll make you crazy. Have a question about retirement? Personal finances? Anything career-related? Click here to drop Kerry Hannon a note. What is the importance of having a financial plan and working with an adviser? There are ways to improve your life satisfaction with money. But a lot of people don't go about it that way. One of the ways that helps to get away from the money chase is that when you put a financial plan together, one of the things that ends up coming out of that process is the answer to: What is this money going to? Why do you want to put money in the market? Maybe you’re saving for your kids' college, buying a house, or retirement. Now we know how much risk to take in order to achieve your goals. That draws down stress. When you put a financial plan together, you take as much risk as necessary, but not more, to achieve your goals. You're working with intentionality, you're working toward a purpose. If you're not saving toward a goal, you end up taking on too much risk. That's how people lose sleep at night. Having someone to talk you off the ledge and keep you focused on your plan is worth about 2% to 3% a year. That's a huge amount of returns that simply comes about because someone is preventing you from shooting yourself in the foot. And we, as investors, are our own worst enemies. If we can stop our bad behaviors, we're all so much better off. Read more: What is a financial adviser, and what do they do? Kerry Hannon is a Senior Columnist at Yahoo Finance. She is a career and retirement strategist and the author of 14 books, including \" In Control at 50+: How to Succeed in the New World of Work\" and \"Never Too Old to Get Rich.\" Follow her on Bluesky. Sign up for the Mind Your Money newsletter Click here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more Read the latest financial and business news from Yahoo Finance Terms and Privacy Policy Privacy Dashboard More Info Recommended Stories",
    "summary": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Barry Ritholtz explains how not to make stupid investing mistakes The longtime adviser has written a playbook for keeping your strategy simple and not getting in the way of compounding. Kerry Hannon · Senior Columnist Sun, Mar 23, 2025, 6:30 PM 7 min read Barry Ritholtz, co-founder and chief investment officer of Ritholtz Wealth Management and a longtime adviser, digs into the things that have made him “less stupid” in his latest book.",
    "sentiment": 0.30434782608695654
  },
  {
    "title": "AI Stocks: Tech Giants, Cloud Titans Face 'Show Me' Moment. CoreWeave IPO On Tap.",
    "url": "https://www.investors.com/news/technology/artificial-intelligence-stocks/?src=A00220&yptr=yahoo",
    "source": "Yahoo Finance",
    "timestamp": "2025-03-23T15:33:48Z",
    "content": "Technology AI Stocks: Tech Giants, Cloud Titans Face 'Show Me' Moment. CoreWeave IPO On Tap. Licensing REINHARDT KRAUSE 11:33 AM ET 03/23/2025 Is the artificial intelligence stock market boom still wired or tired amid the emergence of China's DeepSeek? Top AI stocks such as Microsoft ( MSFT ) and Nvidia ( NVDA ) face high expectations. For many companies — such as Google parent Alphabet ( GOOGL ), Amazon.com ( AMZN ) and Facebook parent Meta Platforms ( META ) — the rise of generative AI poses both risk and opportunity. Amid the rise of generative AI — which generates text, images, and video — it's a good time to be cautious amid the hype, especially given recent developments at Super Micro Computer ( SMCI ). Many companies suddenly tout AI product roadmaps. In general, look for AI stocks that use artificial intelligence to improve products or gain a strategic edge. Meanwhile, Nvidia-backed CoreWeave 's initial public offering could be a bellwether for AI stocks. CoreWeave reportedly will price shares in a range of $47 to $55. The CoreWeave IPO is expected to raise around $2.5 billion, down from earlier estimates of $4 billion. CoreWeave is a new AI cloud services provider that rents out Nvidia GPU-equipped servers. Nvidia Updates AI Roadmap Chip maker Nvidia hosted its GTC Conference in mid-March. Nvidia stock is now down 12% in 2025. For Nvidia, margin pressure as it ramps up production of next-generation Blackwell AI chips in 2025 has been a key issue. At GTC, Nvidia also updated its AI accelerator roadmap.  However, whether customers will really need \"Rubin Ultra\" GPUs in 2027 and \"Feynman\" GPUs in 2028 remains a big question. In 2023 and 2024, semiconductor plays out-performed software companies as the best AI stocks. Investor interest in data center infrastructure stocks has cooled off in 2025. Nvidia and many other AI chip stocks are in the red. What's clear is that AI stocks are under more scrutiny. \"We expect AI to transition from a 'tell me' to a 'show me' story, with any disconnect between investments and revenue generation to come under increased scrutiny,\" said a Bank of America report. Software Stocks To Emerge As Best AI Stocks? One view is that software companies will emerge as the best AI stocks if they can monetize new products and services. At Bank of America, analyst Brad Sill says software IPOs may not be likely near-term. \"Software to cleanse, manage and secure data coupled with enablers of AI models for training and applications (inference) appear to be drawing the most investor interest,\" he said in a report. \"AI-native startups with significantly lower headcount than traditional software companies offering pure AI solutions are likely looking 2-3 years away for IPO exits.\" What's more, data analytics software maker Palantir ( PLTR ) recently hosted its sixth AI event . PLTR stock has climbed nearly 20% in 2025 after soaring 340% last year. Palantir — as well as Snowflake and privately held Databricks — are focused on helping companies use proprietary data to build their own AI models. Here's a look at Databrick's strategy . In an IBD interview , ServiceNow ( NOW ) Chief executive Bill McDermott explained about how the enterprise software maker aims to be an AI winner. ServiceNow stock has dipped 22% this year. At an investor day, Adobe ( ADBE ) disclosed it had a modest $125 million in AI standalone annual recurring revenue as of the end of Q1 2025. Meanwhile, software maker Salesforce ( CRM ) reported Q4 earnings 26 that disappointed. The software maker's fiscal 2026 outlook came in light even though it's ramping up new AI agents. CRM stock has shed 16% in 2025. Snowflake ( SNOW ) Q4 earnings topped expectations . SNOW stock has gained 2.5% in 2025. DeepSeek Shakes Up AI Trade Further, China startup DeepSeek has roiled AI stocks, including Nvidia. DeepSeek came out of nowhere to release a powerful AI training model developed with much less computing power. AI stocks sold off amid new questions over the outlook for capital spending on artificial intelligence infrastructure. Here's IBD's take on the key questions involving DeepSeek , including U.S./China competition in artificial intelligence. Despite the emergence of DeepSeek, cloud computing titans and tech giants plan big increases in artificial-related capital spending in 2025 amid the race to human-like artificial general intelligence (AGI). The AI assistant battleground now includes OpenAI's ChatGPT, xAI's Grok, DeepSeek, Anthropic's Claude, Google's Gemini, Perplexity and Meta. The commoditization of AI models could spur application development. While \"training\" AI models has been the biggest driver of capital spending, the market will shift to \" inferencing ,\" or running AI applications, in the long run. Having struggled to generate new revenue from \"copilots,\" software companies are now turning to autonomous, goal-driven AI agents . One big issue for software companies is how fast customers ramp up pilot programs to commercial deployment. AI Stocks: Meta Sets Llama Conference Meanwhile, Meta stock has advanced 2% in 2025. Further, Meta will host its first developer conference, called LlamaCon, on April 29. The event will showcase Meta's open-source AI model ecosystem and its Llama series of models. A new Llama model is expected to debut. At the event, Meta could release its own AI-driven search engine, posing a new worry for Google. Further, Meta AI now has over 700 million monthly average users , and management believes it is now the No. 1 leading AI assistant. Meta expects to reach 1 billion users in 2025. With AI, the social media giant plans to deliver more personalized and relevant responses for users across apps, including Thread. Meta last year hired away Salesforce's top AI executive, Clara Shih, to head a new \"Business AI\" group. Also, Morgan Stanley projects that Meta's generative AI-related revenue will grow at a 67% compound annual growth rate to $101 billion in 2028, up from $13 billion last year. ↑ X Nvidia Has Dominated The AI Revolution. Can The Chipmaker Stay At The Front Of The Pack? See All Videos NOW PLAYING Nvidia Has Dominated The AI Revolution. Can The Chipmaker Stay At The Front Of The Pack? Amid worries over capital spending, Google stock is down 13% in 2025, while Microsoft has shed 7%. Amazon stock has dropped 10%. One worry for Google is startup OpenAI, which now claims ChatGPT serves 400 million weekly active users, up from 300 million in December 2024. OpenAI has not disclosed figures for paid consumer subscriptions. Its enterprise usage figure has doubled since September 2024, reaching 2 million paying business users. U.S. Chip Export Restrictions A Wild Card Among AI stocks to watch, Apple ( AAPL ) has lagged in 2025. Apple stock has shed nearly 13%. The big question has been whether Apple Intelligence features in iPhone 16 models will spur a big upgrade cycle. Based on Apple's December quarter results , a big AI-driven upgrade cycle has not yet kicked in. And, voice assistant Siri has yet to be upgraded with advanced AI technology. Meanwhile, Apple in March shook up its AI leadership, with Mike Rockwell taking over from John Giannandrea. In 2018, Apple hired away Giannandrea from Google. In 2021, Apple hired another top AI scientist at Google, Samy Bengio. But Apple still fell behind in AI. The 2025 capital spending plans of cloud computing giants remain robust. But AI chip export restrictions remain a wild card on Nvidia stock as well as Advanced Micro Devices ( AMD ). AMD stock is down 12% in 2025. On the earnings front, Broadcom ( AVGO ) reported fiscal Q1 results on March 6. Broadcom stock popped on its AI chip demand outlook. Broadcom makes custom AI chips for cloud computing titans. But Broadcom stock is down 17% in 2025. Qualcomm ( QCOM ), ARM Holdings ( ARM ), and Marvell Technologies ( MRVL ) are other AI chip makers to watch. Among other data center infrastructure plays, Arista Networks ( ANET ) reported fourth-quarter earnings and revenue that topped Wall Street targets. Full year 2025 revenue guidance for Arista stock underwhelmed. Arista stock is down 25% this year. Microsoft is the biggest investor in generative AI leader OpenAI, having spent some $14 billion on the startup. But Oracle will now be a big provider of data center capacity to OpenAI for training AI models. Most of Microsoft's new AI revenue comes from its cloud computing business, not software upgrades. Meanwhile, startups OpenAI and Anthropic are battling Google, Meta and others in developing large, multimodal and small language foundation models . Also, AI technology uses computer algorithms. The software programs aim to mimic the human ability to learn, interpret patterns and make predictions. Until recently, machine learning was largely limited to models that processed data to make predictions. The AI models focused on pattern recognition from existing data. Corporate spending on AI projects was modest as companies mulled return on investment. AI Stocks To Watch By Industry Group Company Symbol Comp Rating Industry name AI angle Nvidia ( NVDA ) 85 Elec-Semiconductor Fabless Cloud computing giants buying more chips to train AI models or run AI workloads. Big lead over rival Advanced Micro Devices ( AMD ). CrowdStrike ( CRWD ) 94 Computer Software-Security AI chatbots expected to automate more functions in security-operations centers and reduce the time to detect computer hacking. Arista Networks ( ANET ) 68 Computer-Networking Sells computer network switches that speed up communications among racks of computer servers packed into \"hyperscale\" data centers. With AI growth, internet data centers will need more network bandwidth. Microsoft ( MSFT ) 62 Computer Software-Desktop Biggest investor in generative AI startup Open AI, whose ChatGPT users require Azure cloud services. Microsoft's business AI assistant, Office 365 Copilot, will have general availability on Nov. 1. Salesforce ( CRM ) 75 Computer Software-Enterprise Pivoted to autonomous, goal-driven AI agents from conversational co-pilots. Expected to use a mix of subscription and consumption-based pricing. Amazon.com ( AMZN ) 73 Retail-Internet Alexa smart assistant upgraded. Cloud computing unit working with OpenAI rivals Anthropic, Hugging Face and Falcon 40B. New generative AI models process \"prompts,\" such as internet search queries, that describe what a user wants to get. Generative AI technologies create text, images, video and computer programming code on their own. Companies will aim to boost productivity by developing customized AI for specific industries. Proprietary company data will be used to train AI models. AI systems require massive computing power to find patterns and make inferences from large quantities of data. So the race is on to build AI chips for data centers, self-driving cars, robotics, smartphones, drones and other devices. For chipmakers, analysts expect a market for \"edge AI\" — on-device processing of AI apps to emerge. Will AI Startups Challenge Tech Giants What's more, one key question for investors is whether tech industry incumbents will be the big generative AI winners. Or, will a new wave of AI startups eventually dominate? OpenAI has told employees its now on an annual revenue run-rate of $3.4 billion, up from $2 billion in January. OpenAI has raised $6.6 billion in new funding, valuing the startup at $157 billion , up from $86 billion early this year. The new round was led by venture-capital firm Thrive Capital. Microsoft again invested. New investors include SoftBank and Nvidia but not Apple as rumored. Further, OpenAI recently laid out more details of its plans to adopt a for-profit business structure in 2025. Large language models provide the building blocks to develop applications. Further, LLMs help AI systems understand the way that humans write and speak. Also, LLMs require training data for specific tasks. Companies with access to troves of data hold an edge. OpenAI is part of a wave of LLM startups that includes AI21 Labs, Anthropic and Cohere.  Anthropic's latest funding round values it at $61.5 billion. Follow Reinhardt Krause on Twitter @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MAY ALSO LIKE: Want To Trade Options? Here Are The Basics To Get You Started IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Monitor IBD's \"Breaking Out Today\" List For Companies Hitting New Buy Points IBD Live: A New Tool For Daily Stock Market Analysis",
    "summary": "Technology AI Stocks: Tech Giants, Cloud Titans Face 'Show Me' Moment. CoreWeave IPO On Tap. Licensing REINHARDT KRAUSE 11:33 AM ET 03/23/2025 Is the artificial intelligence stock market boom still wired or tired amid the emergence of China's DeepSeek? Top AI stocks such as Microsoft ( MSFT ) and Nvidia ( NVDA ) face high expectations.",
    "sentiment": 0.6666666666666666
  }
]